Tekla.Structures.Filtering.BooleanOperatorType
The Boolean operator type defines the operators between two Boolean filter expressions.

Tekla.Structures.Filtering.BooleanOperatorType.IS_EQUAL
The "is equal" operator.

Tekla.Structures.Filtering.BooleanOperatorType.IS_NOT_EQUAL
The "is not equal" operator.

Tekla.Structures.Filtering.BooleanOperatorType.BOOLEAN_OR
The Boolean OR operator.

Tekla.Structures.Filtering.BooleanOperatorType.BOOLEAN_AND
The Boolean AND operator.